In [5]:
import pandas as pd

# Read the text file
df = pd.read_csv('example2.txt', header=None)

# Display the DataFrame
print(df)

# data = [ 'ACME', 50, 91.1, (2012, 12, 21) ]
# name, shares, price, date = data
# name

          0
0    Line 1
1    Line 2
2    Line 3
3    Line 4
4  finished

In [8]:
data = [10, 20, 30, 40, 50]
s = pd.Series(data)
print(s)
print(s[2])     # Access the element with label 2 (value 30)
print(s.iloc[3]) # Access the element at position 3 (value 40)
print(s[1:4])   # Access a range of elements by label

0    10
1    20
2    30
3    40
4    50
dtype: int64
30
40
1    20
2    30
3    40
dtype: int64

In [ ]:
import pandas as pd
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)
print(df.loc[1])            # Access the second row by label
print(df.iloc[2])           # Access the third row by position
print(df[['Name', 'Age']])  # Select specific columns
print(df[1:3])              # Select specific rows

unique_dates = df['Age'].unique()
print(unique_dates)

# You can filter data in a DataFrame based on conditions using inequality operators
high_above_102 = df[df['Age'] > 25]

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago
Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object
Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
[25 30 35 28]

In [2]:
import pandas as pd
#Define a dictionary 'x'
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [3]:
#Retrieving the "ID" column and assigning it to a variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [4]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

In [5]:
# retrieve the data for Department, Salary and ID columns
z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [9]:
# To view the column as a series, just use one bracket
# Get the Student column as a series Object

x = df['Department']
x

0    Architect Group
1     Software Group
2        Design Team
3     Infrastructure
Name: Department, dtype: object

In [10]:
df2=df
# set the "Name" column as an index column using the method set_index()
df2=df2.set_index("Name")
#Now, let us access the column using the name
df2.loc['Jane', 'Salary']

50000

In [11]:
# To slice out a set of rows, you use this syntax: data[start:stop]

# let us do the slicing using old dataframe df
df.iloc[0:2, 0:3]

#let us do the slicing using loc() function on old dataframe df 
# where index column is having labels as 0,1,2
df.loc[0:2,'ID':'Department']

#let us do the slicing using loc() function on new dataframe df2 
# where index column is Name having labels: Rose, John and Jane
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

In [14]:
import pandas as pd
xlsx_path = 'https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/n9LOuKI9SlUa1b5zkaCMeg/Product-sales.xlsx'
df = pd.read_excel(xlsx_path)
df.head()

,OrderID,Product,Category,Quantity,Price,Total,OrderDate,CustomerCity
0,1,Laptop,Electronics,2,800,1600,2022-01-10,New York
1,2,Smartphone,Electronics,3,600,1800,2022-02-15,Los Angeles
2,3,Desk Chair,Furniture,5,150,750,2022-03-12,Chicago
3,4,Notebook,Stationery,10,2,20,2022-04-05,Houston
4,5,Monitor,Electronics,1,300,300,2022-05-21,Miami

In [15]:
x = df[['Quantity']]
x

   Quantity
0         2
1         3
2         5
3        10
4         1

In [16]:
# Access to multiple columns
y = df[['Product','Category', 'Quantity']]
y

      Product     Category  Quantity
0      Laptop  Electronics         2
1  Smartphone  Electronics         3
2  Desk Chair    Furniture         5
3    Notebook   Stationery        10
4     Monitor  Electronics         1

In [17]:
# Access the value on the first row and the first column
df.iloc[0, 0]

1

In [18]:
# Access the column using the name
df.loc[0, 'Product']

'Laptop'

In [19]:
# Slicing the dataframe
df.iloc[0:2, 0:3]

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics

In [23]:
# Slicing the dataframe using name
df.loc[0:2, 'OrderID':'Category']

   OrderID     Product     Category
0        1      Laptop  Electronics
1        2  Smartphone  Electronics
2        3  Desk Chair    Furniture